In [1]:
import numpy as np
import pandas as pd

In [5]:
time=pd.read_csv('messages.csv')
date=pd.read_csv('orders.csv')

In [6]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [7]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [8]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

# Working with dates

In [10]:
# Converting to date time data type

date['date']=pd.to_datetime(date['date'])

In [12]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

# 1. Extract Year

In [13]:
date['date_year']=date['date'].dt.year

In [14]:
date.sample(5)

          date  product_id  city_id  orders  date_year
906 2019-02-18        5428       26       1       2019
37  2018-08-18        4436       17       2       2018
903 2019-10-18        4128       18       2       2019
542 2019-06-10        2652       18      69       2019
820 2019-07-27        7239       22       2       2019

# 2. Extract Month

In [15]:
date['date_month']=date['date'].dt.month

In [16]:
date.sample(5)

          date  product_id  city_id  orders  date_year  date_month
693 2019-07-26        2271        3      60       2019           7
51  2019-08-12        6344       26       1       2019           8
821 2018-12-07        4996        5       6       2018          12
185 2019-11-29        4294       14       4       2019          11
833 2019-11-04        6695        9       5       2019          11

In [17]:
date['month_name']=date['date'].dt.month_name()

In [18]:
date.sample(5)

          date  product_id  city_id  orders  date_year  date_month month_name
195 2019-05-01        5470       16      23       2019           5        May
586 2019-06-26        2563       18       8       2019           6       June
3   2019-08-17        7292       25       1       2019           8     August
148 2019-12-10         561       13       1       2019          12   December
977 2018-12-14         460       18       4       2018          12   December

# 3. Extract Date

In [19]:
date['date_day']=date['date'].dt.day

In [20]:
date.head()

,date,product_id,city_id,orders,date_year,date_month,month_name,date_day
0,2019-12-10,5628,25,3,2019,12,December,10
1,2018-08-15,3646,14,157,2018,8,August,15
2,2018-10-23,1859,25,1,2018,10,October,23
3,2019-08-17,7292,25,1,2019,8,August,17
4,2019-01-06,4344,25,3,2019,1,January,6

In [21]:
# day of the week

date['day_of_week']=date['date'].dt.day_name()

In [22]:
date.sample(5)

,date,product_id,city_id,orders,date_year,date_month,month_name,date_day,day_of_week
398,2019-07-19,2307,4,9,2019,7,July,19,Friday
156,2019-04-25,568,8,25,2019,4,April,25,Thursday
176,2018-12-16,1475,16,8,2018,12,December,16,Sunday
517,2019-01-06,6671,20,28,2019,1,January,6,Sunday
963,2019-10-14,7011,9,24,2019,10,October,14,Monday

In [23]:
# to check that day is weekend or not

date['date_is_weekend']=np.where(date['day_of_week'].isin(['Sunday','Saturday']),1,0)

In [24]:
date.sample(5)

,date,product_id,city_id,orders,date_year,date_month,month_name,date_day,day_of_week,date_is_weekend
972,2019-11-08,5282,4,6,2019,11,November,8,Friday,0
990,2018-10-28,3034,0,1,2018,10,October,28,Sunday,1
834,2018-07-27,398,22,8,2018,7,July,27,Friday,0
376,2018-09-01,5738,13,22,2018,9,September,1,Saturday,1
997,2019-05-07,487,26,14,2019,5,May,7,Tuesday,0

Extract  quarter of the year

In [29]:
date['date_week']=date['date'].dt.quarter

Extract Semesters

In [30]:
date['semester']=np.where(date['date_week'].isin([1,2]),'first','second')

Time elapsed between dates

In [31]:
import datetime

today = datetime.datetime.today()

today

datetime.datetime(2023, 9, 12, 23, 40, 2, 887050)

In [32]:
today - date['date']

0     1372 days 23:40:02.887050
1     1854 days 23:40:02.887050
2     1785 days 23:40:02.887050
3     1487 days 23:40:02.887050
4     1710 days 23:40:02.887050
                 ...
995   1800 days 23:40:02.887050
996   1741 days 23:40:02.887050
997   1589 days 23:40:02.887050
998   1654 days 23:40:02.887050
999   1428 days 23:40:02.887050
Name: date, Length: 1000, dtype: timedelta64[ns]

In [33]:
(today - date['date']).dt.days

0      1372
1      1854
2      1785
3      1487
4      1710
       ...
995    1800
996    1741
997    1589
998    1654
999    1428
Name: date, Length: 1000, dtype: int64

In [34]:
# Months passed

np.round((today -date['date']) / np.timedelta64(1, 'M'),0)

0      44.0
1      60.0
2      58.0
3      48.0
4      55.0
       ...
995    58.0
996    56.0
997    51.0
998    53.0
999    46.0
Name: date, Length: 1000, dtype: float64

In [35]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [36]:
# Converting to datetime datatype
time['date'] = pd.to_datetime(time['date'])

In [37]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [38]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

Extract Time Part

In [39]:
time['time'] = time['date'].dt.time

time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

Time DFifference

In [40]:
today - time['date']

0     3558 days 22:50:02.887050
1     3423 days 00:00:02.887050
2     3908 days 23:19:02.887050
3     3210 days 23:09:02.887050
4     3608 days 00:29:02.887050
                 ...
995   4197 days 22:50:02.887050
996   3519 days 00:26:02.887050
997   3984 days 00:03:02.887050
998   4100 days 00:06:02.887050
999   3372 days 00:15:02.887050
Name: date, Length: 1000, dtype: timedelta64[ns]

In [41]:
# in seconds

(today - time['date'])/np.timedelta64(1,'s')

0      3.074934e+08
1      2.957472e+08
2      3.377351e+08
3      2.774273e+08
4      3.117329e+08
           ...
995    3.627030e+08
996    3.040432e+08
997    3.442178e+08
998    3.542404e+08
999    2.913417e+08
Name: date, Length: 1000, dtype: float64

In [42]:
# in minutes

(today - time['date'])/np.timedelta64(1,'m')

0      5.124890e+06
1      4.929120e+06
2      5.628919e+06
3      4.623789e+06
4      5.195549e+06
           ...
995    6.045050e+06
996    5.067386e+06
997    5.736963e+06
998    5.904006e+06
999    4.855695e+06
Name: date, Length: 1000, dtype: float64

In [44]:
# in hours

(today - time['date'])/np.timedelta64(1,'h')

0       85414.834135
1       82152.000802
2       93815.317469
3       77063.150802
4       86592.484135
           ...
995    100750.834135
996     84456.434135
997     95616.050802
998     98400.100802
999     80928.250802
Name: date, Length: 1000, dtype: float64